/*****************************************************************************************************
  * @project    grayscale
  * @author     BoyLuc追梦少年南南
  * @version    V1.0
  * @date       2023-08-13
  * @brief      灰度传感器
  * @phenomenon 灰度传感器校准后（感为灰度传感器自带校准功能，请按照说明书使用）观察传感器上面的灯的亮灭
  * @attention  没有添加行驶代码！
  *             编译前注意自己的dirverlib路径；
  *             在e芯工作室的代码基础上进行二次封装与算法设计，可以视为为该板的BSP；
  *             非商业用途，盗版侵权必究！
  ****************************************************************************************************/
#include "boylibs\headfile.h"
void main(void)
{
    system_init(0);
    set_DCO_48MH();
    boy_grayscale_init();
    while(1)
    {
        boy_read_grayscale();
    }
}
